Gregification/BeeMS/BeeMS/VT_MSPM0L1306_A/src/Core/system.cpp
    //BOR
    {
        // levels: 0:1V62, 1:2V23, 2:2V82, 3:2V95 . (see 7.6.1)
        // didn't notice anything about min-voltage for clock speeds
        DL_SYSCTL_setBORThreshold(DL_SYSCTL_BOR_THRESHOLD_LEVEL::DL_SYSCTL_BOR_THRESHOLD_LEVEL_1);
    }


    DL_GPIO_disablePower(GPIOA);
    DL_GPIO_reset(GPIOA);
    DL_GPIO_enablePower(GPIOA);
    delay_cycles(POWER_STARTUP_DELAY);

    #ifdef PROJECT_ENABLE_UART0
    {
        DL_UART_disablePower(uart0.reg);
        DL_UART_reset(uart0.reg);
        DL_UART_enablePower(uart0.reg);
        delay_cycles(POWER_STARTUP_DELAY);

        constexpr DL_UART_ClockConfig config_uart_clk = {
                .clockSel   = DL_UART_CLOCK::DL_UART_CLOCK_BUSCLK,
                .divideRatio= DL_UART_CLOCK_DIVIDE_RATIO::DL_UART_CLOCK_DIVIDE_RATIO_1,
            };
        constexpr DL_UART_Config config_uart = {
                .mode        = DL_UART_MODE::DL_UART_MAIN_MODE_NORMAL,
                .direction   = DL_UART_DIRECTION::DL_UART_MAIN_DIRECTION_TX_RX,
                .flowControl = DL_UART_FLOW_CONTROL::DL_UART_MAIN_FLOW_CONTROL_NONE,
                .parity      = DL_UART_PARITY::DL_UART_MAIN_PARITY_NONE,
                .wordLength  = DL_UART_WORD_LENGTH::DL_UART_MAIN_WORD_LENGTH_8_BITS,
                .stopBits    = DL_UART_STOP_BITS::DL_UART_MAIN_STOP_BITS_ONE
            };
        DL_UART_setClockConfig(uart0.reg, &config_uart_clk);
        DL_UART_init(uart0.reg, &config_uart);

        DL_UART_setOversampling(uart0.reg, DL_UART_OVERSAMPLING_RATE::DL_UART_OVERSAMPLING_RATE_16X);

        DL_UART_setRXFIFOThreshold(uart0.reg, DL_UART_RX_FIFO_LEVEL::DL_UART_RX_FIFO_LEVEL_ONE_ENTRY);
        DL_UART_setTXFIFOThreshold(uart0.reg, DL_UART_TX_FIFO_LEVEL::DL_UART_TX_FIFO_LEVEL_3_4_EMPTY);
        DL_UART_enableFIFOs(uart0.reg); // not required but very useful

        DL_GPIO_initPeripheralOutputFunctionFeatures( // PA8
                IOMUX_PINCM9,
                IOMUX_PINCM9_PF_UART0_TX,
                DL_GPIO_INVERSION::DL_GPIO_INVERSION_DISABLE,
                DL_GPIO_RESISTOR::DL_GPIO_RESISTOR_NONE,
                DL_GPIO_DRIVE_STRENGTH::DL_GPIO_DRIVE_STRENGTH_HIGH,
                DL_GPIO_HIZ::DL_GPIO_HIZ_DISABLE
            );
        DL_GPIO_initPeripheralInputFunctionFeatures( // PA9
                IOMUX_PINCM10,
                IOMUX_PINCM10_PF_UART0_RX,
                DL_GPIO_INVERSION::DL_GPIO_INVERSION_DISABLE,
                DL_GPIO_RESISTOR::DL_GPIO_RESISTOR_NONE,
                DL_GPIO_HYSTERESIS::DL_GPIO_HYSTERESIS_ENABLE,
                DL_GPIO_WAKEUP::DL_GPIO_WAKEUP_DISABLE
            );

        DL_UART_enable(uart0.reg);
    }
    #endif

    #ifdef PROJECT_ENABLE_I2C0
        // TODO: code to set this up. should look like I2C1's init code below
    #endif
    #ifdef PROJECT_ENABLE_I2C1
    {
        DL_I2C_disablePower(i2c1.reg);
        DL_I2C_reset(i2c1.reg);
        DL_I2C_enablePower(i2c1.reg);
        delay_cycles(POWER_STARTUP_DELAY);

        /* timeout calculation. TDS.20.2.3.6/1520. or see the DL comments in their api.
         * formula -> "X / (1 / <clk> * 520 * 1e6) + 1"
         *      X: max wait in uS
         */
        DL_I2C_setTimeoutACount(i2c1.reg, 50.0 * configCPU_CLOCK_HZ / 520.0e6 + 1);
        DL_I2C_enableTimeoutA(i2c1.reg); // SCL low timeout detection

        // PA15
        DL_GPIO_initPeripheralInputFunctionFeatures(
                IOMUX_PINCM16,
                IOMUX_PINCM16_PF_I2C1_SCL,
                DL_GPIO_INVERSION::DL_GPIO_INVERSION_DISABLE,
                DL_GPIO_RESISTOR::DL_GPIO_RESISTOR_NONE,
                DL_GPIO_HYSTERESIS::DL_GPIO_HYSTERESIS_DISABLE,
                DL_GPIO_WAKEUP::DL_GPIO_WAKEUP_DISABLE
            );
        // PA16
        DL_GPIO_initPeripheralInputFunctionFeatures(
                IOMUX_PINCM17,
                IOMUX_PINCM17_PF_I2C1_SDA,
                DL_GPIO_INVERSION::DL_GPIO_INVERSION_DISABLE,
                DL_GPIO_RESISTOR::DL_GPIO_RESISTOR_NONE,
                DL_GPIO_HYSTERESIS::DL_GPIO_HYSTERESIS_DISABLE,
                DL_GPIO_WAKEUP::DL_GPIO_WAKEUP_DISABLE
            );

        DL_I2C_ClockConfig clk_config = {
                 .clockSel      = DL_I2C_CLOCK::DL_I2C_CLOCK_BUSCLK,
                 .divideRatio   = DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_2
            };
        DL_I2C_setClockConfig(i2c1.reg, &clk_config);
        DL_I2C_enableAnalogGlitchFilter(i2c1.reg);
        DL_I2C_setControllerAddressingMode(i2c1.reg, DL_I2C_CONTROLLER_ADDRESSING_MODE::DL_I2C_CONTROLLER_ADDRESSING_MODE_7_BIT);

        // as controller
        DL_I2C_resetControllerTransfer(i2c1.reg);

        DL_I2C_setControllerTXFIFOThreshold(i2c1.reg, DL_I2C_TX_FIFO_LEVEL::DL_I2C_TX_FIFO_LEVEL_BYTES_1);
        DL_I2C_setControllerRXFIFOThreshold(i2c1.reg, DL_I2C_RX_FIFO_LEVEL::DL_I2C_RX_FIFO_LEVEL_BYTES_1);
        DL_I2C_enableControllerClockStretching(i2c1.reg);

        i2c1.setSCLTarget(100e3);

        DL_I2C_enableController(i2c1.reg);

//        NVIC_DisableIRQ(I2C1_INT_IRQn);
//        DL_I2C_enableInterrupt(i2c1.reg,
//                  DL_I2C_INTERRUPT_CONTROLLER_RXFIFO_TRIGGER
//                | DL_I2C_INTERRUPT_CONTROLLER_TXFIFO_TRIGGER
//                | DL_I2C_INTERRUPT_CONTROLLER_TX_DONE
//                | DL_I2C_INTERRUPT_CONTROLLER_RX_DONE
//                | DL_I2C_INTERRUPT_TIMEOUT_A
//                | DL_I2C_INTERRUPT_TIMEOUT_B
//            );
    }
    #endif

    #ifdef PROJECT_ENABLE_SPI0
    {
        // high speed SPI
        DL_SPI_disablePower(spi0.reg);
        DL_SPI_reset(spi0.reg);
        DL_SPI_enablePower(spi0.reg);
        delay_cycles(POWER_STARTUP_DELAY);

        /*--- GPIO config ----------------*/

        DL_GPIO_initPeripheralOutputFunctionFeatures(//    SCLK ,  PA11
                IOMUX_PINCM12,
                IOMUX_PINCM12_PF_SPI0_SCLK,
                DL_GPIO_INVERSION::DL_GPIO_INVERSION_DISABLE,
                DL_GPIO_RESISTOR::DL_GPIO_RESISTOR_NONE,
                DL_GPIO_DRIVE_STRENGTH::DL_GPIO_DRIVE_STRENGTH_HIGH,
                DL_GPIO_HIZ::DL_GPIO_HIZ_DISABLE
            );
        DL_GPIO_initPeripheralOutputFunctionFeatures(//    MOSI, PA5
                IOMUX_PINCM6,
                IOMUX_PINCM6_PF_SPI0_PICO,
                DL_GPIO_INVERSION::DL_GPIO_INVERSION_DISABLE,
                DL_GPIO_RESISTOR::DL_GPIO_RESISTOR_NONE,
                DL_GPIO_DRIVE_STRENGTH::DL_GPIO_DRIVE_STRENGTH_LOW,
                DL_GPIO_HIZ::DL_GPIO_HIZ_DISABLE
            );
        DL_GPIO_initPeripheralInputFunctionFeatures(//      MISO , PA10
                IOMUX_PINCM11,
                IOMUX_PINCM11_PF_SPI0_POCI,
                DL_GPIO_INVERSION::DL_GPIO_INVERSION_DISABLE,
                DL_GPIO_RESISTOR::DL_GPIO_RESISTOR_NONE,
                DL_GPIO_HYSTERESIS::DL_GPIO_HYSTERESIS_ENABLE,
                DL_GPIO_WAKEUP::DL_GPIO_WAKEUP_DISABLE
            );
        DL_GPIO_enableHiZ(IOMUX_PINCM11); // MISO
        DL_GPIO_enableOutput(GPIOPINPUX(GPIO::PA11));
        DL_GPIO_enableOutput(GPIOPINPUX(GPIO::PA5));
        DL_GPIO_enableOutput(GPIOPINPUX(GPIO::PA10));

